wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_can.c
    /* abort transmit mailbox */
    mdes = can_ram_address_get(can_periph, index);
    mdes0 = *(uint32_t *)mdes;
    mdes0 &= ~CAN_MDES0_CODE;
    mdes0 |= MDES0_CODE(CAN_MB_TX_STATUS_ABORT);
    *(uint32_t *)mdes = mdes0;
}

/*!
    \brief      inactive transmit mailbox (API_ID:0x0018U)
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[in]  index: mailbox index
                only one parameter can be selected which is shown as below:
      \arg        0 - 31
    \param[out] none
    \retval     none
*/
void can_mailbox_transmit_inactive(uint32_t can_periph, uint32_t index)
{
    uint32_t mdes0;
    uint32_t mdes;

    /* inactive transmit mailbox */
    mdes = can_ram_address_get(can_periph, index);
    mdes0 = *(uint32_t *)mdes;
    mdes0 &= ~CAN_MDES0_CODE;
    mdes0 |= MDES0_CODE(CAN_MB_TX_STATUS_INACTIVE);
    *(uint32_t *)mdes = mdes0;
}

/*!
    \brief      read receive mailbox data (API_ID:0x0019U)
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[in]  index: mailbox index
                only one parameter can be selected which is shown as below:
      \arg        0 - 31
    \param[out] mdpara: mailbox descriptor struct
    \retval     ERROR or SUCCESS
    \note       This function contains scenarios leading to an infinite loop.
                Modify according to the user's actual usage scenarios.
*/
ErrStatus can_mailbox_receive_data_read(uint32_t can_periph, uint32_t index, can_mailbox_descriptor_struct *mdpara)
{
    ErrStatus status = ERROR;
    uint32_t i;
    uint32_t cnt;
    uint32_t timeout;
    uint32_t mdes;
    uint32_t *mdaddr;
    uint32_t mdes1;

#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(mdpara)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0019U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        mdes = can_ram_address_get(can_periph, index);
        mdaddr = (uint32_t *)mdpara;
        /* wait mailbox data ready */
        timeout = CAN_DELAY;
        while(((*(uint32_t *)mdes) & MDES0_CODE(CAN_MB_RX_STATUS_BUSY)) && (timeout)) {
            timeout--;
        }
        if((*(uint32_t *)mdes) & MDES0_CODE(CAN_MB_RX_STATUS_BUSY)) {
            status = ERROR;
        }

        /* get mailbox descriptor 0 */
        *mdaddr = *(uint32_t *)mdes;
        mdes1 = *(uint32_t *)((uint32_t)(mdes + 0x04U));
        mdpara->id = (mdes1 & 0x1FFFFFFFU);
        mdpara->prio = (mdes1 & 0xE0000000U) >> 29U;
        mdpara->data_bytes = can_payload_size_compute(*mdaddr);
        cnt = (mdpara->data_bytes + 3U) / 4U;
        mdes = mdes + 0x08U;
        for(i = 0U; i < cnt; i++) {
            *((uint32_t *)(&mdpara->data[i * 4U])) = *(uint32_t *)mdes;
            mdes = mdes + 4U;
        }

        /* clear mailbox status */
        CAN_STAT(can_periph) = STAT_MS(index);
        /* unlock mailbox */
        CAN_TIMER(can_periph);

        /* get mailbox ID */
        if(mdpara->ide) {
            mdpara->id = GET_MDES1_ID_EXD(mdpara->id);
        } else {
            mdpara->id = GET_MDES1_ID_STD(mdpara->id);
        }

        /* get mailbox data */
        if(mdpara->data_bytes) {
            can_data_to_little_endian_swap((uint32_t *)mdpara->data, (uint32_t *)mdpara->data, mdpara->data_bytes);
        }

        status = SUCCESS;
    }
    return status;
}

/*!
    \brief      lock the receive mailbox (API_ID:0x001AU)
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[in]  index: mailbox index
                only one parameter can be selected which is shown as below:
      \arg        0 - 31
    \param[out] none
    \retval     none
*/
void can_mailbox_receive_lock(uint32_t can_periph, uint32_t index)
{
    uint32_t mdes;

    mdes = can_ram_address_get(can_periph, index);
    REG32(mdes);
}

/*!
    \brief      unlock the receive mailbox (API_ID:0x001BU)
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[out] none
    \retval     none
*/
void can_mailbox_receive_unlock(uint32_t can_periph)
{
    CAN_TIMER(can_periph);
}

/*!
    \brief      inactive the receive mailbox (API_ID:0x001CU)
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[in]  index: mailbox index
                only one parameter can be selected which is shown as below:
      \arg        0 - 31
    \param[out] none
    \retval     none
*/
void can_mailbox_receive_inactive(uint32_t can_periph, uint32_t index)
{
    uint32_t mdes0;
    uint32_t mdes;

    /* inactive receive mailbox */
    mdes = can_ram_address_get(can_periph, index);
    mdes0 = *(uint32_t *)mdes;
    mdes0 &= ~CAN_MDES0_CODE;
    mdes0 |= MDES0_CODE(CAN_MB_RX_STATUS_INACTIVE);
    *(uint32_t *)mdes = mdes0;
}

/*!
    \brief      get mailbox code value (API_ID:0x001DU)
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[in]  index: mailbox index(0~31)
                only one parameter can be selected which is shown as below:
      \arg        0 - 31
    \param[out] none
    \retval     mailbox code
*/
uint32_t can_mailbox_code_get(uint32_t can_periph, uint32_t index)
{
    uint32_t code;
    uint32_t mdes;

    mdes = can_ram_address_get(can_periph, index);
    code = GET_MDES0_CODE(*(uint32_t *)mdes);
    return code;
}

/*!
    \brief      configure error counter (API_ID:0x001EU)
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[in]  errcnt_struct
                  fd_data_phase_rx_errcnt: 0-255
                  fd_data_phase_tx_errcnt: 0-255
                  rx_errcnt: 0-255
                  tx_errcnt: 0-255
    \retval     none
*/
void can_error_counter_config(uint32_t can_periph, can_error_counter_struct *errcnt_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(errcnt_struct)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x001EU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        CAN_ERR0(can_periph) = ERR0_REFCNT(errcnt_struct->fd_data_phase_rx_errcnt) | ERR0_TEFCNT(errcnt_struct->fd_data_phase_tx_errcnt) | \
                               ERR0_RECNT(errcnt_struct->rx_errcnt) | ERR0_TECNT(errcnt_struct->tx_errcnt);
    }
}

/*!
    \brief      get error counter (API_ID:0x001FU)
    \param[in]  can_periph: CANx(x=0,1,2)
    \param[out] errcnt_struct
                  fd_data_phase_rx_errcnt: 0-255
                  fd_data_phase_tx_errcnt: 0-255
                  rx_errcnt: 0-255
                  tx_errcnt: 0-255
    \retval     none
*/
void can_error_counter_get(uint32_t can_periph, can_error_counter_struct *errcnt_struct)
{
    uint32_t reg;

